In [2]:
import pandas  as pd

In [3]:
data=[1,2,3,4,5] 
series1=pd.Series(data)  #Series is used for 1-d array
series1
#print(type(series1))

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
#Renaming the index
data=[1,2,3]
srs=pd.Series(data,index=['a','b','c'])
print(srs)
print(srs['a':'b'])

a    1
b    2
c    3
dtype: int64
a    1
b    2
dtype: int64

In [11]:
#DataFrame- 2D 
data=[[1,2,3,4],[1,2,3,4]]
srs=pd.DataFrame(data)
print(srs)

   0  1  2  3
0  1  2  3  4
1  1  2  3  4

In [13]:
data1=[[1,2,3,4,5,6],[1,2,3,4]]
srs1=pd.DataFrame(data1)
print(srs1)
#Here since there is only 4 values in second list it take NaN where it doesnt have value

   0  1  2  3    4    5
0  1  2  3  4  5.0  6.0
1  1  2  3  4  NaN  NaN

In [18]:
#Dictionary
data1={'a':[1,2,3,4,5,6],'b':[1,2,3,4,5,6]}
srs1=pd.DataFrame(data1)
print(srs1)

   a  b
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5
5  6  6

In [19]:
#eg
dict1={'fruits':['apple','mango','grapes'],'count':[10,20,30]}
d=pd.DataFrame(dict1)
d

   fruits  count
0   apple     10
1   mango     20
2  grapes     30

In [25]:
#Numpy
import numpy as np
data=np.array([['apple','mango','grapes'],[10,20,40]])
d1=pd.DataFrame({'fruits':data[0],'count':data[1]})
d1

   fruits count
0   apple    10
1   mango    20
2  grapes    40

In [33]:
data=[1,2,3]
d=pd.DataFrame(data)
d.rename(index={0:'A',1:'B',2:'C'},inplace='true')
d.rename(index=str,columns={0:'A'},inplace='true')
d

   A
A  1
B  2
C  3

In [42]:
data=[1,2,3,4]
d=pd.DataFrame(data)
d.rename(index={0:'A',1:'B',2:'C',3:'D'}, inplace='true')
d.columns=['A']
d

   A
A  1
B  2
C  3
D  4

In [47]:
data=[1,2,3,4]
d=pd.DataFrame(data)
d.rename(index={0:'A',1:'B',2:'C',3:'D'}, inplace='true')
collist=[]
d.columns=['A']

for col in d.columns:
    if col=='A':
        col='B'
    collist.append(col)
d.columns=collist
d

   B
A  1
B  2
C  3
D  4

In [4]:
import pandas as pd
a=pd.DataFrame({"A":[1,2,3,4],"B":[2,3,4,5]})
a

   A  B
0  1  2
1  2  3
2  3  4
3  4  5

In [6]:
a1=pd.DataFrame({"A":[3,4,5,6],"C":[2,3,4,5]})
a1

   A  C
0  3  2
1  4  3
2  5  4
3  6  5

In [8]:
pd.concat([a,a1]) #Similar to outer join

   A    B    C
0  1  2.0  NaN
1  2  3.0  NaN
2  3  4.0  NaN
3  4  5.0  NaN
0  3  NaN  2.0
1  4  NaN  3.0
2  5  NaN  4.0
3  6  NaN  5.0

In [10]:
pd.concat([a,a1],axis=0,join='inner') #inner join, 0-column, 1-rows

   A
0  1
1  2
2  3
3  4
0  3
1  4
2  5
3  6

In [11]:
pd.concat([a,a1],axis=1,join='inner') #concat is not the most prefereed one, merge works the same as sql

   A  B  A  C
0  1  2  3  2
1  2  3  4  3
2  3  4  5  4
3  4  5  6  5

In [13]:
pd.merge(a,a1,on='A',how='inner')

   A  B  C
0  3  4  2
1  4  5  3

In [15]:
pd.merge(a,a1,how='outer')

   A    B    C
0  1  2.0  NaN
1  2  3.0  NaN
2  3  4.0  2.0
3  4  5.0  3.0
4  5  NaN  4.0
5  6  NaN  5.0

In [16]:
pd.merge(a,a1,how='right')

   A    B  C
0  3  4.0  2
1  4  5.0  3
2  5  NaN  4
3  6  NaN  5

In [17]:
pd.merge(a,a1,how='left')

   A  B    C
0  1  2  NaN
1  2  3  NaN
2  3  4  2.0
3  4  5  3.0